In [1]:
import pandas as pd
import numpy as np

In [2]:
dict1 = {
    "name": ["Jarett", "Tester", "Test"],
    "designation": ["Developer", "QA", "Tester"],
    "city": ["Verna", "Tester", "Test"]
}

In [3]:
df = pd.DataFrame(dict1)

In [4]:
df

     name designation    city
0  Jarett   Developer   Verna
1  Tester          QA  Tester
2    Test      Tester    Test

In [6]:
df.to_csv("data.csv")

In [7]:
df.to_csv("data2.csv", index=False)

In [8]:
df.head(2)

     name designation    city
0  Jarett   Developer   Verna
1  Tester          QA  Tester

In [12]:
df.tail(2)

     name designation    city
1  Tester          QA  Tester
2    Test      Tester    Test

In [14]:
train_df = pd.read_csv('trains.csv')

In [15]:
train_df.head()

   Train Num  Speed     City
0     123423    100    Verna
1      87657    120  Kolkata
2      98763     80   Mumbai

In [16]:
train_df['Speed']

0    100
1    120
2     80
Name: Speed, dtype: int64

In [17]:
train_df['Speed'][0]

100

In [18]:
train_df['Speed'][0] = 50

C:\Users\Jarett\AppData\Local\Temp\ipykernel_24180\3685448129.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  train_df['Speed'][0] = 50

In [19]:
train_df

   Train Num  Speed     City
0     123423     50    Verna
1      87657    120  Kolkata
2      98763     80   Mumbai

In [20]:
train_df.to_csv('updated_trains.csv')

In [21]:
### Series

In [22]:
ser = pd.Series(np.random.rand(10))

In [23]:
ser

0    0.339948
1    0.425178
2    0.635187
3    0.416896
4    0.166626
5    0.070093
6    0.386904
7    0.181272
8    0.044781
9    0.250798
dtype: float64

In [24]:
type(ser)

pandas.core.series.Series

In [25]:
### Data Frame

In [28]:
new_df = pd.DataFrame(np.random.rand(334, 5), index=np.arange(334))

In [29]:
new_df.head(5)

          0         1         2         3         4
0  0.109209  0.904499  0.150126  0.839303  0.593613
1  0.398945  0.533152  0.354245  0.468834  0.847397
2  0.242672  0.534014  0.952043  0.885470  0.932456
3  0.833478  0.239791  0.695519  0.691132  0.495701
4  0.092860  0.537154  0.263159  0.954158  0.403196

In [30]:
type(new_df)

pandas.core.frame.DataFrame

In [32]:
new_df.describe()

                0           1           2           3           4
count  334.000000  334.000000  334.000000  334.000000  334.000000
mean     0.516197    0.477970    0.501125    0.509168    0.488032
std      0.286520    0.281263    0.293285    0.301970    0.284464
min      0.000393    0.003300    0.002910    0.010382    0.000989
25%      0.273676    0.235172    0.237566    0.254446    0.242578
50%      0.515152    0.473808    0.515144    0.516590    0.463304
75%      0.745559    0.714073    0.767973    0.764846    0.723155
max      0.993054    0.996143    0.997927    0.999217    0.999718

In [33]:
new_df.dtypes

0    float64
1    float64
2    float64
3    float64
4    float64
dtype: object

In [34]:
new_df.index

Int64Index([  0,   1,   2,   3,   4,   5,   6,   7,   8,   9,
            ...
            324, 325, 326, 327, 328, 329, 330, 331, 332, 333],
           dtype='int64', length=334)

In [37]:
new_df.T

,0,1,2,3,4,5,6,7,8,9,...,324,325,326,327,328,329,330,331,332,333
0,0.109209,0.398945,0.242672,0.833478,0.092860,0.575242,0.903326,0.620235,0.413015,0.534978,...,0.178471,0.555771,0.584716,0.607280,0.725508,0.650092,0.871124,0.167299,0.961057,0.499015
1,0.904499,0.533152,0.534014,0.239791,0.537154,0.707178,0.153457,0.195130,0.986643,0.610911,...,0.552848,0.270039,0.532659,0.445004,0.755727,0.051743,0.483641,0.143496,0.205307,0.472681
2,0.150126,0.354245,0.952043,0.695519,0.263159,0.104168,0.355328,0.024966,0.595617,0.097592,...,0.810991,0.961881,0.460707,0.534719,0.811786,0.574089,0.286273,0.526742,0.223413,0.532423
3,0.839303,0.468834,0.885470,0.691132,0.954158,0.062496,0.421001,0.373982,0.063857,0.606241,...,0.972456,0.526327,0.061955,0.300093,0.768711,0.985581,0.898461,0.943323,0.614553,0.230047
4,0.593613,0.847397,0.932456,0.495701,0.403196,0.526175,0.238154,0.030832,0.002529,0.777405,...,0.365883,0.450390,0.700623,0.924257,0.758827,0.254984,0.132322,0.192081,0.644419,0.741236

In [38]:
new_df.head(5)

          0         1         2         3         4
0  0.109209  0.904499  0.150126  0.839303  0.593613
1  0.398945  0.533152  0.354245  0.468834  0.847397
2  0.242672  0.534014  0.952043  0.885470  0.932456
3  0.833478  0.239791  0.695519  0.691132  0.495701
4  0.092860  0.537154  0.263159  0.954158  0.403196

In [39]:
new_df.loc[0,0] = 5.0

In [41]:
new_df.head(5)

          0         1         2         3         4
0  5.000000  0.904499  0.150126  0.839303  0.593613
1  0.398945  0.533152  0.354245  0.468834  0.847397
2  0.242672  0.534014  0.952043  0.885470  0.932456
3  0.833478  0.239791  0.695519  0.691132  0.495701
4  0.092860  0.537154  0.263159  0.954158  0.403196

In [43]:
new_df = new_df.drop(0, axis=1)

In [44]:
new_df.head()

          1         2         3         4
0  0.904499  0.150126  0.839303  0.593613
1  0.533152  0.354245  0.468834  0.847397
2  0.534014  0.952043  0.885470  0.932456
3  0.239791  0.695519  0.691132  0.495701
4  0.537154  0.263159  0.954158  0.403196

In [45]:
### Conditions

In [48]:
new_df.loc[(new_df[1] < 0.3)].head(5)

           1         2         3         4
3   0.239791  0.695519  0.691132  0.495701
6   0.153457  0.355328  0.421001  0.238154
7   0.195130  0.024966  0.373982  0.030832
14  0.206636  0.804109  0.475368  0.614961
25  0.033191  0.778546  0.819428  0.244201

In [51]:
new_df.loc[(new_df[1] < 0.3) & (new_df[2] > 0.1)].head(5)

           1         2         3         4
3   0.239791  0.695519  0.691132  0.495701
6   0.153457  0.355328  0.421001  0.238154
14  0.206636  0.804109  0.475368  0.614961
25  0.033191  0.778546  0.819428  0.244201
26  0.270028  0.538543  0.356565  0.189700

In [52]:
# Modify original Df, use inplace=True

In [53]:
new_df.head()

          1         2         3         4
0  0.904499  0.150126  0.839303  0.593613
1  0.533152  0.354245  0.468834  0.847397
2  0.534014  0.952043  0.885470  0.932456
3  0.239791  0.695519  0.691132  0.495701
4  0.537154  0.263159  0.954158  0.403196

In [62]:
new_df.drop([1,4], axis=1, inplace=True)

            2         3
0    0.150126  0.839303
1    0.354245  0.468834
2    0.952043  0.885470
3    0.695519  0.691132
4    0.263159  0.954158
..        ...       ...
329  0.574089  0.985581
330  0.286273  0.898461
331  0.526742  0.943323
332  0.223413  0.614553
333  0.532423  0.230047

[334 rows x 2 columns]

In [63]:
new_df

            2         3
0    0.150126  0.839303
1    0.354245  0.468834
2    0.952043  0.885470
3    0.695519  0.691132
4    0.263159  0.954158
..        ...       ...
329  0.574089  0.985581
330  0.286273  0.898461
331  0.526742  0.943323
332  0.223413  0.614553
333  0.532423  0.230047

[334 rows x 2 columns]

In [64]:
df.shape

(3, 3)

In [67]:
df.info

<bound method DataFrame.info of      name designation    city
0  Jarett   Developer   Verna
1  Tester          QA  Tester
2    Test      Tester    Test>